/************************************************************************************

* Kalman_Filter.c
* 描述:卡尔曼滤波器

* 所支持的芯片:9S12XS
* 所支持的编译器：CodeWarrior 5.X

* 作者：    孙谦       (第七届电磁)


* 程序版本：V1.10 
* 更新时间：2013-05-25
*************************************************************************************/

/*--------------- I N C L U D E S ------------------------------------*/

#ifndef _KALMAN_FILTER_H
#define _KALMAN_FILTER_H

/////////////////////////////////////////
extern float Angle, Angle_dot; 		//外部需要引用的变量

//////////////////////////////////////////
void Kalman_Filter(float angle_m,float gyro_m);

#endif /*PORT_H END */
